public/inbox/victus-15-fa0xxx-freezing-after-suspend-fix/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Victus 15 Fa0xxx Freezing After Suspend Fix</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Victus 15 Fa0xxx Freezing After Suspend Fix</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Preface</a>
</li>
<li><a href="#headline-2">Overview</a>
</li>
<li><a href="#headline-3">Install Dependencies</a>
</li>
<li><a href="#headline-4">RPM Build Folder</a>
</li>
<li><a href="#headline-5">Downloading kernel sources</a>
</li>
<li><a href="#headline-6">Unpack the sources</a>
</li>
<li><a href="#headline-7">Adding patch file</a>
</li>
<li><a href="#headline-8">Editing Kernel Spec File</a>
</li>
<li><a href="#headline-9">Building</a>
</li>
<li><a href="#headline-10">Installing the new kernel</a>
</li>
<li><a href="#headline-11">Updating Grub</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Preface
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><strong>THIS DIDN&#39;T ACTUALLY FIX IT FOR ME</strong></p>
<p>
I have a Victus 15 fa0xxx laptop that fails to wake up from
suspend. When waking up, something happens with the Alder Lake
Integrated GPU that causes the screen to flicker on and off and ALL
graphics to be incredibly laggy.</p>
<p>
The DMESG log is flooded with these errors while the post-suspend
lags happens:</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>[  340.318790] i915 0000:00:02.0: [drm] *ERROR* [ENCODER:235:DDI A/PHY A][DPRX] Failed to enable link training
</span></span><span style="display:flex;"><span>[  343.109774] i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>[  347.748749] i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>[  351.453727] i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>[  356.114702] i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92</span></span></code></pre></div>
</div>
<p>
And the journalctl log…</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>Sep 02 23:06:04 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>Sep 02 23:06:05 fedora NetworkManager[1667]: &lt;info&gt;  [1693721165.5382] dhcp4 (wlp4s0): state changed new lease, address=192.168.81.105
</span></span><span style="display:flex;"><span>Sep 02 23:06:05 fedora systemd[1]: Starting NetworkManager-dispatcher.service - Network Manager Script Dispatcher Service...
</span></span><span style="display:flex;"><span>Sep 02 23:06:05 fedora systemd[1]: Started NetworkManager-dispatcher.service - Network Manager Script Dispatcher Service.
</span></span><span style="display:flex;"><span>Sep 02 23:06:05 fedora audit[1]: SERVICE_START pid=1 uid=0 auid=4294967295 ses=4294967295 subj=system_u:system_r:init_t:s0 msg=&#39;unit=NetworkManager-dispatcher comm=&#34;systemd&#34; exe=&#34;/usr/lib/systemd/systemd&#34; hostname=? addr=? terminal=? res=success&#39;
</span></span><span style="display:flex;"><span>Sep 02 23:06:08 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>Sep 02 23:06:13 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>Sep 02 23:06:15 fedora systemd[1]: NetworkManager-dispatcher.service: Deactivated successfully.
</span></span><span style="display:flex;"><span>Sep 02 23:06:15 fedora audit[1]: SERVICE_STOP pid=1 uid=0 auid=4294967295 ses=4294967295 subj=system_u:system_r:init_t:s0 msg=&#39;unit=NetworkManager-dispatcher comm=&#34;systemd&#34; exe=&#34;/usr/lib/systemd/systemd&#34; hostname=? addr=? terminal=? res=success&#39;
</span></span><span style="display:flex;"><span>Sep 02 23:06:19 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to write source OUI
</span></span><span style="display:flex;"><span>Sep 02 23:06:25 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* [ENCODER:235:DDI A/PHY A][DPRX] Failed to enable link training
</span></span><span style="display:flex;"><span>Sep 02 23:06:28 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>Sep 02 23:06:33 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92
</span></span><span style="display:flex;"><span>Sep 02 23:06:38 fedora kernel: i915 0000:00:02.0: [drm] *ERROR* Failed to read DPCD register 0x92</span></span></code></pre></div>
</div>
<p>
I found a post on the Arch forums with someone reporting the same
problem. I guess the Alder Lake IGPUs Video BIOS incorrectly reports which ports
are connected to the GPU which causes Linux to freakout.</p>
<p>
<a href="https://wiki.archlinux.org/title/intel_graphics#Freeze_after_wake_from_sleep/suspend_with_Alder_Lake-P">Post</a></p>
<p>
The solution is to apply a patch to the Linux Kernel for the Intel
Drivers. This post shows how to do that using Fedora.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Overview
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>We&#39;re going to be downloading the packages needed to build RPM
packages. After downloading the Linux sources from Fedora, we&#39;ll apply
the patch and build the kernel into installable RPM files</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Install Dependencies
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>sudo dnf install fedpkg fedora-packager rpmdevtools ncurses-devel pesign</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
RPM Build Folder
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>This will create a template folder in <code>$HOME/rpmbuild</code> which sets up
the directory structure needed when creating RPM packages. It&#39;ll have
folders like BUILD, BUILDROOT, SPECS, SOURCES, etc.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>rpmdev-setuptree
</span></span><span style="display:flex;"><span>cd ~/rpmbuild</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Downloading kernel sources
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>This will download the kernel sources for the same version of Linux
you&#39;re currently running. The file will be saved locally to an RPM file</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cd $HOME
</span></span><span style="display:flex;"><span>koji download-build --arch<span style="color:#f92672">=</span>src kernel-<span style="color:#66d9ef">$(</span>uname -r | sed <span style="color:#e6db74">&#34;s/\.</span><span style="color:#66d9ef">$(</span>arch<span style="color:#66d9ef">)</span><span style="color:#e6db74">//&#34;</span><span style="color:#66d9ef">)</span>.src.rpm</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Unpack the sources
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>By default this will extract the files into our <code>rpmbuild</code> folder</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>rpm -Uvh kernel-5.1.16-300.fc30.src.rpm</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Adding patch file
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>In the rpmbuild/SOURCE folder, create a file named
<code>intel_display.c.patch</code>. Paste the following in there.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>From: Email &lt;email@email.com&gt;
</span></span><span style="display:flex;"><span>Subject: <span style="color:#f92672">[</span>PATCH<span style="color:#f92672">]</span> Victus Suspend Fix
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>--- a/drivers/gpu/drm/i915/display/intel_display.c
</span></span><span style="display:flex;"><span>+++ b/drivers/gpu/drm/i915/display/intel_display.c
</span></span><span style="display:flex;"><span>@@ -8835,7 +8835,7 @@ static void intel_setup_outputs<span style="color:#f92672">(</span>struct drm_i915_private *dev_priv<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>                intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_TC1<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>        <span style="color:#f92672">}</span> <span style="color:#66d9ef">else</span> <span style="color:#66d9ef">if</span> <span style="color:#f92672">(</span>IS_ALDERLAKE_P<span style="color:#f92672">(</span>dev_priv<span style="color:#f92672">))</span> <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>                intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_A<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>-               intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_B<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>+               // intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_B<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_TC1<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_TC2<span style="color:#f92672">)</span>;
</span></span><span style="display:flex;"><span>                intel_ddi_init<span style="color:#f92672">(</span>dev_priv, PORT_TC3<span style="color:#f92672">)</span>;</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Editing Kernel Spec File
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>The kernel.spec file contains metadata, build configurations, build
dependencies, and other information for building the linux kernel. Its
used by Fedora&#39;s build process specifically. In that file we can also
specify which patches we want to apply.</p>
<p>
Navigate to the <code>SPECS</code> folder and run these commands</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cd ~/rpmbuild/SPECS/
</span></span><span style="display:flex;"><span>sudo dnf builddep kernel.spec</span></span></code></pre></div>
</div>
<p>
Edit the file and change the line</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span># define buildid .local
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>TO
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>%define buildid .intel_display</span></span></code></pre></div>
</div>
<p>
Now just before the <code>END OF PATCH DEFINITIONS</code> line, add the following:</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>Patch9001: intel_display.c.patch</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Building
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>This will start compiling the kernel. For myself it took about 20
minutes to complete. On my slower machines it can take well over an hour.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>rpmbuild -bb --without debug --target<span style="color:#f92672">=</span>x86_64 kernel.spec</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
Installing the new kernel
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>After your kernel has compiled you can install it by doing a couple of commands.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cd ~/rpmbuild/RPMS/x86_64/
</span></span><span style="display:flex;"><span>sudo dnf install kernel*</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
Updating Grub
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>After everything is installed you need to update grub.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>sudo grub2-mkconfig -o /etc/grub2-efi.cfg</span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
